let a = 5, b = 2;
let 
c = a + b;  // сумма a и b
d = a - b;  // разница между a и b
e = a * b;  // произведение a и b
f = a / b;  // частное от деления a на b
g = a % b;  // остаток от деления a на b  
h = a ** b; // результат возведения числа a в степень b

console.log(
    "сумма a и b    = " + c +"\n" + 
    "разница между a и b    = " + d +"\n" + 
    "произведение a и b    = " + e +"\n" + 
    "частное от деления a на b    = " + f +"\n" + 
    "остаток от деления a на b    = " + g +"\n" + 
    "результат возведения числа a в степень b    = " + h 
    );
